04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/hotRoomBoussinesq/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 300;

boundaryField
{
    floor
    {
        type            functionalFixedValue;

        value
        {
            type    zonal;

            defaultValue    300;

            zones
            {
                hotFaces
                {
                    type        box;

                    zone
                    {
                        type        patch;
                        patch       floor;
                    }

                    box         (4.5 -1000 4.5) (5.5 1e-5 5.5);

                    value  600;
                }
            }
        }
    }

    ceiling
    {
        type            fixedValue;
        value           uniform 300;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
